#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 11052                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: jieunb_b <boj.kr/u/jieunb_b>                +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/11052                          #+#        #+#      #+#     #
#    Solved: 2025/07/07 22:49:11 by jieunb_b      ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
import sys
input = sys.stdin.readline

n = int(input())
p = list(map(int, input().split()))

dp = [0]*(n+1)

# 카드 1개 가질 때: i=1, dp[i] = p[i-1] // p1 = 1
# 카드 2개 가질 때: i=2, dp[i] = max(p[i-1],) 1개 가질 때*2 혹은 2개의 값 // p2 = 1+1 or 5 -> 5
# 카드 3개 가질 때: i=3, 2개(이전 인덱스)에 1개일 때 혹은 3개의 값 // p3 = 1+1+1 or 5+1 or 6 -> 6
# 카드 4개 가질 때: i=4, 3개에 1개일 때 // p4 = 1+1+1+1 or 5+5 or 6+1 or 7

for i in range(1, n+1):
    dp[i] = p[i-1]
    for j in range(i): # 4 or 4-1:1,3 or 4-2:2,2 or 4-3:1,3 # 3 , 3-1, 3-2
        dp[i] = max(dp[i], dp[i-j]+dp[j])
print(dp[-1])