#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2164                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: jieunb_b <boj.kr/u/jieunb_b>                +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2164                           #+#        #+#      #+#     #
#    Solved: 2025/04/05 23:29:24 by jieunb_b      ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
import sys
from collections import deque
input = sys.stdin.readline

n = int(input())
queue = deque()
for i in range(n):
    queue.append(i+1)

while len(queue) > 1:
    # 버리기
    queue.popleft()
    # 큐에 추가하기
    queue.append(queue.popleft())
print(queue.popleft())



# 제일 위 카드를 바닥에 버리기
# 다음 카드를 제일 아래 카드 밑으로 옮기기
# 마지막에 남는 카드 구하기
# 1 
# 12 -> 2
# 123 -> 23 -> 32 -> 2
# 1234 -> 234 -> 342 -> 42 -> 24 -> 4
# 12345 -> 2345 -> 3452 -> 452 -> 524 -> 24 -> 42 -> 2
# 123456 -> 23456 -> 34562 -> 4562 -> 5624 -> 624 -> 246 -> 46 -> 64 -> 4
# 1234567 -> 234567 -> 345672 -> 45672 -> 56724 -> 6724 -> 7246 -> 246 -> 462 -> 62 -> 26 -> 6