#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2251                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: jieunb_b <boj.kr/u/jieunb_b>                +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2251                           #+#        #+#      #+#     #
#    Solved: 2024/10/18 11:13:00 by jieunb_b      ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
import sys
input = sys.stdin.readline

A, B, C = map(int, input().split())
a, b, c = 0, 0, C

# c에서 a로 옮길 경우

# c에서 b로 옮길 경우


# a에서 b로 옮길 경우

# a에서 c로 옮길 경우


# b에서 a로 옮길 경우

# b에서 c로 옮길 경우